app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT * FROM "contacts"

  def edit
    @contact = Contact.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("created_at", "updated_at", "last_name", "birthday", "first_name", "middle_name") VALUES('2010-03-25 23:28:49', '2010-03-25 23:28:49', NULL, NULL, 'Luis', NULL)

  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
UPDATE "contacts" SET "updated_at" = '2010-03-26 15:29:24', "middle_name" = 'Emilio', "last_name" = '' WHERE "id" = 1